---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotMoveElementWithoutWorkplane
source: html/b4e5ab02-5c91-2ebf-4119-d965535fbd5f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotMoveElementWithoutWorkplane Property

Element(s) need a workplane to be moved in. There's no workplane defined in this view.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMoveElementWithoutWorkplane { get; }
```